export default {

    // 아이템 별칭

    안경 : "구애안경",
    머리띠 : "구애머리띠",
    스카프 : "구애스카프",
    스캎 : "구애스카프",
    휘석 : "진화의휘석",
    돌조 : "돌격조끼",
    생구 : "생명의구슬",

    // 기술 별칭

    아헤 : "아이언헤드",
    오폭 : "오물폭탄",

    // 포켓몬 별칭

    삼삼 : "삼삼드래",
    드펄 : "드래펄트",
    수컷냐오닉스 : "냐오닉스",
    수컷에써르 : "에써르",
    수컷퍼퓨돈 : "퍼퓨돈",
    수컷대쓰여너 : "대쓰여너",
    암컷니드런 : "니드런♀",
    수컷니드런 : "니드런♂",

    비캐스퐁 : "비바라기캐스퐁",
    눈캐스퐁 : "설경캐스퐁",
    싸라기눈캐스퐁 : "설경캐스퐁",
    테오키스어택폼 : "어택폼테오키스",
    테오키스스피드폼 : "스피드폼테오키스",
    테오키스디펜스폼 : "디펜스폼테오키스",
    초목도롱 : "도롱마담",
    초목도롱마담 : "도롱마담",
    풀도롱마담 : "도롱마담",
    땅도롱 : "모래땅도롱마담",
    땅도롱마담 : "모래땅도롱마담",
    모래땅도롱 : "모래땅도롱마담",
    강철도롱 : "슈레도롱마담",
    강철도롱마담 : "슈레도롱마담",
    슈레도롱 : "슈레도롱마담",
    이글이글춤추새 : "춤추새",
    불꽃춤추새 : "춤추새",
    불춤추새 : "춤추새",
    전기춤추새 : "파칙파칙춤추새",
    에스퍼춤추새 : "훌라훌라춤추새",
    고스트춤추새 : "하늘하늘춤추새",

    일격우라오스 : "우라오스",

    // 특성 별칭


    // 테라타입 별칭

    불테라 : "불꽃테라",
    페테라 : "페어리테라",

    // 성격 별칭

    장꾸 : "장난꾸러기",

    // 날씨 별칭

    비바라기 : "비",
    설경 : "눈",
    끝의대지 : "큰가뭄",
    시작의바다 : "폭우",

    
}