export default {

    // 아이템 별칭

    안경 : "구애안경",
    머리띠 : "구애머리띠",
    스카프 : "구애스카프",
    스캎 : "구애스카프",
    휘석 : "진화의휘석",
    돌조 : "돌격조끼",
    생구 : "생명의구슬",

    // 기술 별칭

    하보 : "하이퍼보이스",
    파광 : "파괴광선",

    플드 : "플레어드라이브",
    불펀 : "불꽃펀치",
    니차 : "니트로차지",
    화방 : "화염방사",
    불대 : "불대문자",
    오힛 : "오버히트",
    매플 : "매지컬플레임",
    메플 : "매지컬플레임",
    메지컬플레임 : "매지컬플레임",

    웨태 : "웨이브태클",
    폭오 : "폭포오르기",
    아브 : "아쿠아브레이크",
    아젯 : "아쿠아제트",
    아제 : "아쿠아제트",
    하펌 : "하이드로펌프",

    기관총 : "씨기관총",

    와볼 : "와일드볼트",
    번펀 : "번개펀치",
    볼부비 : "볼부비부비",
    '10볼' : "10만볼트",
    십볼 : "10만볼트",
    '10만' : "10만볼트",
    십만볼트 : "10만볼트",
    십만 : "10만볼트",
    볼체 : "볼트체인지",
    일렉볼 : "일렉트릭볼",

    고떨 : "고드름떨구기",
    냉펀 : "냉동펀치",
    고침 : "고드름침",
    트악 : "트리플악셀",
    얼뭉 : "얼음뭉치",
    냉빔 : "냉동빔",
    프드 : "프리즈드라이",

    인파 : "인파이트",
    엄힘 : "엄청난힘",
    무차 : "무릎차기",
    마펀 : "마하펀치",
    바프 : "바디프레스",
    드펀 : "드레인펀치",
    성칼 : "성스러운칼",
    삑구 : "기합구슬",
    삑살구슬 : "기합구슬",

    독찌 : "독찌르기",
    더슛 : "더스트슈트",
    오폭 : "오물폭탄",
    오웨 : "오물웨이브",

    십만마력 : "10만마력",
    대힘 : "대지의힘",

    브버 : "브레이브버드",
    에슬 : "에어슬래시",

    사박 : "사념의박치기",
    사이킥 : "사이코키네시스",
    사쇼 : "사이코쇼크",
    사쇽 : "사이코쇼크",

    벌야법 : "벌레의야단법석",
    경단 : "꽃가루경단",

    스엣 : "스톤에지",
    스에 : "스톤에지",
    스샤 : "스톤샤워",
    암봉 : "암석봉인",
    양박 : "양날박치기",
    록블 : "록블라스트",
    락블 : "록블라스트",

    고다 : "고스트다이브",
    섀클 : "섀도클로",
    나헤 : "나이트헤드",
    병첨 : "병상첨병",
    드크 : "드래곤클로",
    용파 : "용의파동",

    깨부 : "깨물어부수기",
    깨물부 : "깨물어부수기",
    탁떨 : "탁쳐서떨구기",
    악파 : "악의파동",

    아헤 : "아이언헤드",
    불펀 : "불릿펀치",
    불릿 : "불릿펀치",
    러캐 : "러스터캐논",

    치근 : "치근거리기",
    매샤 : "매지컬샤인",
    메샤 : "매지컬샤인",

    // 버프기술

    칼춤 : "+2",
    '1칼춤' : "+2",
    '2칼춤' : "+4",
    '3칼춤' : "+6",

    음모 : "+2",
    나쁜음모 : "+2",
    '1음모' : "+2",
    '1나쁜음모' : "+2",
    '2음모' : "+4",
    '2나쁜음모' : "+4",
    '3음모' : "+6",
    '3나쁜음모' : "+6",

    철벽 : "+2",
    '1철벽' : "+2",
    '2철벽' : "+4",
    '3철벽' : "+6",

    녹기 : "+2",
    '1녹기' : "+2",
    '2녹기' : "+4",
    '3녹기' : "+6",

    망각술 : "+2",
    '1망각술' : "+2",
    '2망각술' : "+4",
    '3망각술' : "+6",

    용춤 : '+1',
    '1용춤' : '+1',
    '2용춤' : '+2',
    '3용춤' : '+3',
    '4용춤' : '+4',
    '5용춤' : '+5',
    '6용춤' : '+6',

    벌크업 : '+1',
    '1벌크업' : '+1',
    '2벌크업' : '+2',
    '3벌크업' : '+3',
    '4벌크업' : '+4',
    '5벌크업' : '+5',
    '6벌크업' : '+6',

    코스믹파워 : '+1',
    '1코스믹파워' : '+1',
    '2코스믹파워' : '+2',
    '3코스믹파워' : '+3',
    '4코스믹파워' : '+4',
    '5코스믹파워' : '+5',
    '6코스믹파워' : '+6',

    똬리 : '+1',
    '1똬리' : '+1',
    '2똬리' : '+2',
    '3똬리' : '+3',
    '4똬리' : '+4',
    '5똬리' : '+5',
    '6똬리' : '+6',
    똬리틀기 : '+1',
    '1똬리틀기' : '+1',
    '2똬리틀기' : '+2',
    '3똬리틀기' : '+3',
    '4똬리틀기' : '+4',
    '5똬리틀기' : '+5',
    '6똬리틀기' : '+6',

    나비춤 : '+1',
    '1나비춤' : '+1',
    '2나비춤' : '+2',
    '3나비춤' : '+3',
    '4나비춤' : '+4',
    '5나비춤' : '+5',
    '6나비춤' : '+6',
    
    명상 : '+1',
    '1명상' : '+1',
    '2명상' : '+2',
    '3명상' : '+3',
    '4명상' : '+4',
    '5명상' : '+5',
    '6명상' : '+6',
    
    껍깨 : '1껍질깨기',
    껍질깨기 : '1껍질깨기',
    '1껍깨' : '1껍질깨기',
    '2껍깨' : '2껍질깨기',
    '3껍깨' : '3껍질깨기',
    '4껍깨' : '4껍질깨기',
    '5껍깨' : '5껍질깨기',
    '6껍깨' : '6껍질깨기',

    배북 : '+6',

    // 포켓몬 별칭

    휘석럭키 : "진화의휘석 럭키",

    삼삼 : "삼삼드래",
    드펄 : "드래펄트",
    한카 : "한카리아스",
    불카 : "불카모스",
    수컷냐오닉스 : "냐오닉스",
    수컷에써르 : "에써르",
    수컷퍼퓨돈 : "퍼퓨돈",
    수컷대쓰여너 : "대쓰여너",
    암컷니드런 : "니드런♀",
    수컷니드런 : "니드런♂",

    비캐스퐁 : "비바라기캐스퐁",
    눈캐스퐁 : "설경캐스퐁",
    싸라기눈캐스퐁 : "설경캐스퐁",
    테오키스어택폼 : "어택폼테오키스",
    테오키스스피드폼 : "스피드폼테오키스",
    테오키스디펜스폼 : "디펜스폼테오키스",
    초목도롱 : "도롱마담",
    초목도롱마담 : "도롱마담",
    풀도롱마담 : "도롱마담",
    땅도롱 : "모래땅도롱마담",
    땅도롱마담 : "모래땅도롱마담",
    모래땅도롱 : "모래땅도롱마담",
    강철도롱 : "슈레도롱마담",
    강철도롱마담 : "슈레도롱마담",
    슈레도롱 : "슈레도롱마담",
    이글이글춤추새 : "춤추새",
    불꽃춤추새 : "춤추새",
    불춤추새 : "춤추새",
    전기춤추새 : "파칙파칙춤추새",
    에스퍼춤추새 : "훌라훌라춤추새",
    고스트춤추새 : "하늘하늘춤추새",

    변신돌핀맨 : "마이티폼돌핀맨",
    마이티돌핀맨 : "마이티폼돌핀맨",

    일격우라오스 : "우라오스",

    물켄타로스 : "워터팔데아켄타로스",
    물팔데아켄타로스 : "워터팔데아켄타로스",
    불켄타로스 : "블레이즈팔데아켄타로스",
    불팔데아켄타로스 : "블레이즈팔데아켄타로스",
    불꽃켄타로스 : "블레이즈팔데아켄타로스",
    불꽃팔데아켄타로스 : "블레이즈팔데아켄타로스",
    물켄타 : "워터팔데아켄타로스",
    불켄타 : "블레이즈팔데아켄타로스",

    물로토무 : "워시로토무",
    풀로토무 : "커트로토무",
    얼음로토무 : "프로스트로토무",
    불꽃로토무 : "히트로토무",
    불로토무 : "히트로토무",
    비행로토무 : "스핀로토무",
    물로톰 : "워시로토무",
    풀로톰 : "커트로토무",
    얼음로톰 : "프로스트로토무",
    불꽃로톰 : "히트로토무",
    불로톰 : "히트로토무",
    비행로톰 : "스핀로토무",

    까오 : "아머까오",
    갸라 : "갸라도스",
    루카 : "루카리오",
    하랑 : "하랑우탄",
    마기 : "마기라스",
    더시 : "더시마사리",
    망버지 : "망나뇽",
    얼귀 : "얼음귀신",
    크베 : "크레베이스",
    어써 : "어써러셔",
    싸리 : "싸리용",

    우꼬 : "우렁찬꼬리",
    날치머 : "날개치는머리",
    땅기날 : "땅을기는날개",
    타부 : "타부자고",
    고동달 : "고동치는달",

    노꾜치 : "노고고치",
    세준 : "파치리스",
    박세준 : "파치리스",

    // 특성 별칭


    // 테라타입 별칭

    불테라 : "불꽃테라",
    페테라 : "페어리테라",
    격테라 : "격투테라",

    // 성격 별칭

    장꾸 : "장난꾸러기",

    // 날씨 별칭 + 날씨 생성 특성

    비바라기 : "비",
    잔비 : "비",
    가뭄 : "쾌청",
    설경 : "눈",
    눈퍼뜨리기 : "눈",
    끝의대지 : "큰가뭄",
    시작의바다 : "폭우",
    모래날림 : "모래바람",
    모래 : "모래바람",

    // 필드

    그필 : "그래스필드",
    사필 : "사이코필드",
    미필 : "미스트필드",
    일필 : "일렉트릭필드",

    그래스메이커 : "그래스필드",
    일렉트릭메이커 : "일렉트릭필드",
    사이코메이커 : "사이코필드",
    미스트메이커 : "미스트필드",

    // etc

    더블 : "더블배틀",
    
}